[{"id":"015098dd-36a8-4a48-9fbf-9f7f98451a84","type":"Full Time","url":"https://jobs.github.com/positions/015098dd-36a8-4a48-9fbf-9f7f98451a84","created_at":"Fri Jul 19 18:00:34 UTC 2019","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Senior Ruby on Rails Engineer","description":"\u003cp\u003eDESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.\u003c/p\u003e\n\u003cp\u003eJob Summary:\nApple’s Developer Publication platform team is looking for a Senior Ruby on Rails engineer that loves the challenge of crafting extraordinary n-tier applications. Do you have experience building well-tested, robust REST web services that power web and native clients? Are you detail-oriented, dedicated, focused, highly motivated? Do you have a drive for making it as easy as possible for developers to embrace new technologies quickly, and build the best apps for Apple platforms?\u003c/p\u003e\n\u003cp\u003eYour responsibilities will include crafting and developing powerful and performant REST web services using Ruby on Rails. You will architect and implement critical publication systems and design and develop asynchronous workers to process time-consuming tasks. In addition you will fix bugs and improve existing services with new features while communicating with colleagues to inform them of your progress.\u003c/p\u003e\n\u003cp\u003eKey Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStellar Object Oriented Development skills\u003c/li\u003e\n\u003cli\u003eExcellent skills in using Ruby and the Ruby on Rails framework\u003c/li\u003e\n\u003cli\u003eShown experience building critical RESTful services\u003c/li\u003e\n\u003cli\u003eYou will craft and optimize SQL queries in PostgreSQL\u003c/li\u003e\n\u003cli\u003eSuperb source management skills with git\u003c/li\u003e\n\u003cli\u003eYou are detail-oriented with strong organization skills.\u003c/li\u003e\n\u003cli\u003eYou have a drive and a real passion for collaboration with your team.\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communications.\u003c/li\u003e\n\u003cli\u003eSelf-motivated, independent, and dedicated.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription:\nYou will play a key part in the creation of Apple’s developer documentation which is relied upon by third-party developers of our platforms and technologies. You will move quickly through the various services, solving issues and optimizing processes in our critical distributed system. You are highly motived to build extremely reliable, secure, and performant software. You are an excellent communicator, give and take feedback well, and articulate your ideas clearly. You don’t just hack something together, but thoughtfully craft polished features. Testing is your norm, not an afterthought and you keep your bugs up-to-date and deliver your projects on time.You aren’t afraid to offer new suggestions in terms of process or technology choice.\u003c/p\u003e\n\u003cp\u003eEducation:\nRelevant degree or experience\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 113245155\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eAPPLY URL: \u003ca href=\"https://ars2.equest.com/?response_id=18d6fb264764f9624a6b2db8a26f5e81\"\u003ehttps://ars2.equest.com/?response_id=18d6fb264764f9624a6b2db8a26f5e81\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczlzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6f334722d709f863e4332038043fd4d0df639160/Apple_300x300.jpeg"},{"id":"36f19904-cf04-4731-8396-09b3d0fa81a8","type":"Full Time","url":"https://jobs.github.com/positions/36f19904-cf04-4731-8396-09b3d0fa81a8","created_at":"Fri Jul 19 17:57:23 UTC 2019","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Sr. Software Engineer, Apple Pay","description":"\u003cp\u003eJob Summary:\nImagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\u003c/p\u003e\n\u003cp\u003eAre you passionate about building massively scalable services that surprise and delight? Do you have a natural curiosity for learning new technologies? If you answered yes to both questions, the Apple Pay Server engineering team wants to hear from you.\u003c/p\u003e\n\u003cp\u003eKey Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and implement new features for Apple Pay\u003c/li\u003e\n\u003cli\u003eWrite bullet-proof Java code (thread-safe, performant, object-oriented, and inherently testable)\u003c/li\u003e\n\u003cli\u003eWork directly with the business team to collaborate on current and future initiatives\u003c/li\u003e\n\u003cli\u003eWork directly with the iOS client team on feature definition and development\u003c/li\u003e\n\u003cli\u003eDesign specifications and protocols to tackle novel problems\u003c/li\u003e\n\u003cli\u003eSupport ongoing development efforts\u003c/li\u003e\n\u003cli\u003eWork on overall team’s efforts to fix bugs and diagnose existing issues\u003c/li\u003e\n\u003cli\u003eEmbrace test-driven development\u003c/li\u003e\n\u003cli\u003eUnit tests are not optional on this team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription:\nApple Pay brought mobile payment to millions of customers and it’s just the beginning. We are looking for engineers who are equally comfortable working at the bits and bytes level and designing state of the art objected-oriented web-services. Imagine the freedom of a startup but with the funding and focus of the most valuable company in the world.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava J2EE\u003c/li\u003e\n\u003cli\u003eRDBMS\u003c/li\u003e\n\u003cli\u003eJSON\u003c/li\u003e\n\u003cli\u003eSymmetric encryption TDES/AES\u003c/li\u003e\n\u003cli\u003eAsymmetric encryption RSA/ECC\u003c/li\u003e\n\u003cli\u003ePublic Key Infrastructure (PKI)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGreat-to-have Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGlobalPlatform 2.2.1\u003c/li\u003e\n\u003cli\u003eBSI Technical Guideline TR-03111 - Elliptic Curve Cryptography - Version 2.0\u003c/li\u003e\n\u003cli\u003eNIST Special Publication 800-38B\u003c/li\u003e\n\u003cli\u003eEMV Tokenization\u003c/li\u003e\n\u003cli\u003eAPDU/JavaCard\u003c/li\u003e\n\u003cli\u003eAsn.1\u003c/li\u003e\n\u003cli\u003eHSM (Thales)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation:\nBS degree in computer science or equivalent field plus 3-4 years software development experience or MS degree plus 1-2 years software development experience, or equivalent\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 200079541\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eAPPLY URL: \u003ca href=\"https://ars2.equest.com/?response_id=a0393396286cd9bef2fa673a8eda90f5\"\u003ehttps://ars2.equest.com/?response_id=a0393396286cd9bef2fa673a8eda90f5\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczFzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c91d31859b543ef130f5a9c9edb8e03eedf875a8/Apple_300x300.jpeg"},{"id":"e29aafa2-7f81-4d5c-bf3a-031fbcd2dee1","type":"Full Time","url":"https://jobs.github.com/positions/e29aafa2-7f81-4d5c-bf3a-031fbcd2dee1","created_at":"Fri Jul 19 17:52:29 UTC 2019","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Software Quality Engineer - Automation, Apple Pay","description":"\u003cp\u003eJob Summary:\nImagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\u003c/p\u003e\n\u003cp\u003eJoin our Apple Pay Software Quality Engineering team and drive innovation that matters! In this position, you will be responsible for designing, implementing and supporting an automation framework, APIs and tools that will be used by E2E and UI automation teams.\u003c/p\u003e\n\u003cp\u003eKey Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in payment ecosystems such as point of sale readers and back end\u003c/li\u003e\n\u003cli\u003eStrong software development automation experience\u003c/li\u003e\n\u003cli\u003eProfessional experience with python, ruby, java, javascript and sql.\u003c/li\u003e\n\u003cli\u003eIn-depth understanding of OS X, Windows and/or Unix\u003c/li\u003e\n\u003cli\u003eExcellent problem solving and debugging skills\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eAbility to handle multiple projects and a variety of roles within projects\u003c/li\u003e\n\u003cli\u003eDemonstrated ability to learn and understand the technical components and architecture of the system\u003c/li\u003e\n\u003cli\u003eThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams\u003c/li\u003e\n\u003cli\u003eObsessively passionate, hungry, inquisitive, and seek to solve everyday problems in innovative ways\u003c/li\u003e\n\u003cli\u003eLaser-focused on the smallest details that are important to our customers\u003c/li\u003e\n\u003cli\u003eGood understanding of SQA methodologies \u0026amp; practices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription:\nAs an Apple Pay Software Quality Engineer, you will automate, break and strive improve Apple’s revolutionary mobile payment solution. The ideal candidate will be highly efficient and motivated individual with a love of infrastructure engineering. They must enjoy working on multiple concurrent projects in a fast-paced environment that fosters growth, teamwork, innovation and a passion to change the world.\u003c/p\u003e\n\u003cp\u003eEducation:\nBachelors Degree or Master in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 200079122\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eAPPLY URL: \u003ca href=\"https://ars2.equest.com/?response_id=a28b8cf214cbcdfc0aa840bf8419802f\"\u003ehttps://ars2.equest.com/?response_id=a28b8cf214cbcdfc0aa840bf8419802f\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3RzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cf6fd7e34a58d02455ccbee9144a58497fde9576/Apple_300x300.jpeg"},{"id":"9c7d3637-9c7a-42ed-85d8-3b1ef3301fab","type":"Full Time","url":"https://jobs.github.com/positions/9c7d3637-9c7a-42ed-85d8-3b1ef3301fab","created_at":"Fri Jul 19 17:48:41 UTC 2019","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Siri - Senior Data Platform Engineer","description":"\u003cp\u003eJob Summary:\nThe Siri Search team is building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Siri’s universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every single day.\u003c/p\u003e\n\u003cp\u003eKey Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent programming skills in Python and Java\u003c/li\u003e\n\u003cli\u003eExperience working with large data sets and pipelines, ideally using the Apache software stack (e.g. Spark, HBase)\u003c/li\u003e\n\u003cli\u003eBroad knowledge of computer science and systems; ability to quickly learn new domains\u003c/li\u003e\n\u003cli\u003eProven system development skills in UNIX-type OS (e.g. Linux, Mac OS)\u003c/li\u003e\n\u003cli\u003eExcellent problem-solving and analytic skills\u003c/li\u003e\n\u003cli\u003eGood interpersonal skills and teamwork\u003c/li\u003e\n\u003cli\u003eReal passion for building phenomenal products\u003c/li\u003e\n\u003cli\u003eCuriosity to learn\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription:\nApple is hiring a senior data platform engineer for Siri's Knowledge team. You'll be working at the frontier of AI, crunching massive amounts of data for Siri's knowledge base. In a dynamic, continuously-integrated environment, you'll design and implement robust, scalable systems capable of processing an ever-growing data set while keeping latency low and quality high. You'll work closely with knowledge extraction engineers to integrate new data, and with engineers from across Siri to deliver data for customer-facing services. Your responsibilities will also include developing tools and tests to ensure quality and help diagnose issues.\u003c/p\u003e\n\u003cp\u003eEducation:\nBS or MS in Computer Science or related field\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 200078596\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eAPPLY URL: \u003ca href=\"https://ars2.equest.com/?response_id=c6a2ccb947db1828f7499b1e7880eb60\"\u003ehttps://ars2.equest.com/?response_id=c6a2ccb947db1828f7499b1e7880eb60\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2xzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--80213a1e01180601663d67087a642b6a8dfe2db1/Apple_300x300.jpeg"},{"id":"1f77585e-73c7-4a0e-8979-e15d9e932fe1","type":"Full Time","url":"https://jobs.github.com/positions/1f77585e-73c7-4a0e-8979-e15d9e932fe1","created_at":"Mon Jul 15 16:26:49 UTC 2019","company":"NinthDecimal","company_url":null,"location":"San Francisco, CA, US","title":"Platform Engineer","description":"\u003cp\u003eAbout NinthDecimal:\u003c/p\u003e\n\u003cp\u003eNinthDecimal is the omni-channel marketing platform powered by location data. We’re building a precise understanding of consumer behavior by connecting their digital and physical lives, helping marketers solve some of their biggest market opportunities. Our unique understanding of today’s consumer is built on a strong legacy of innovation and a customer intelligence platform that has been market tested by the world’s leading brands.\u003c/p\u003e\n\u003cp\u003eNinthDecimal provides audience data, activation solutions, measurement, and insights across all media, empowering marketers to succeed in today’s omni-channel and data-driven world.\u003c/p\u003e\n\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eWe are looking for a Platform Engineer that will focus on enhancing a data driven business NinthDecimal. As a Platform Engineer, you should be a quick learner, enthusiastic about learning new technologies. You will implement technical solutions to empower internal/external customers and scale the existing platform. You will work closely with business owners to develop and define key business questions, then work with Data Scientist to build the data sets that answer those questions. You will work with huge data sets and build ETLs and analytic platform to bring datasets together to answer business questions, reporting and drive growth. This job is in our Chicago office.\u003c/p\u003e\n\u003cp\u003eThe responsibilities for this position include these activities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and implementation of the data driven initiatives at NinthDecimal such as Big Data analytics application development and architecture using Spark, Hadoop\u003c/li\u003e\n\u003cli\u003eUnderstanding business requirements and converting them to technical solutions. Create ETLs to take data from various upper stream locations and create a unified dimensional or star schema data model for analytics and reporting.\u003c/li\u003e\n\u003cli\u003eCollaborates with Data Scientist team to transform data and integrate algorithms and models into automated processes.\u003c/li\u003e\n\u003cli\u003eCollaborate with Devops and Operation team to setup highly distribute, large scale and high performance platform systems\u003c/li\u003e\n\u003cli\u003eCollaborate with other Backend engineers to formulate innovative solutions to experiment and implement advanced data algorithms\u003c/li\u003e\n\u003cli\u003eCommunicate complex concepts and the results of the analyses in a clear and effective manner to Product Owners\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications Required:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackground in SQL\u003c/li\u003e\n\u003cli\u003eStrong coding skills in Java, Python\u003c/li\u003e\n\u003cli\u003eExperiences in Scala strong plus\u003c/li\u003e\n\u003cli\u003eExperience with Big Data Technologies such as Hadoop, Spark, Hive.\u003c/li\u003e\n\u003cli\u003eExperience in dealing with hundreds of Tetabytes of data strong plus\u003c/li\u003e\n\u003cli\u003eExperience with building and optimizing large scale and high performance systems\u003c/li\u003e\n\u003cli\u003eKnowledge in Mesos, Yarn, Kubernetes, Docker, Airflow, Luigi\u003c/li\u003e\n\u003cli\u003eStrong collaboration and communication skills within and across teams.\u003c/li\u003e\n\u003cli\u003eB.S. or M.S. in Computer Science or a related field\u003c/li\u003e\n\u003cli\u003eFamiliarity with the digital media / advertising industry is a big plus\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jsco.re/2y3q5\"\u003ehttps://jsco.re/2y3q5\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"ab7ccb60-017d-44d8-8d95-d758ae2dc747","type":"Full Time","url":"https://jobs.github.com/positions/ab7ccb60-017d-44d8-8d95-d758ae2dc747","created_at":"Mon Jul 15 16:20:46 UTC 2019","company":"NinthDecimal","company_url":null,"location":"Mountain View, CA, US","title":"Platform Engineer","description":"\u003cp\u003eAbout NinthDecimal:\u003c/p\u003e\n\u003cp\u003eNinthDecimal is the omni-channel marketing platform powered by location data. We’re building a precise understanding of consumer behavior by connecting their digital and physical lives, helping marketers solve some of their biggest market opportunities. Our unique understanding of today’s consumer is built on a strong legacy of innovation and a customer intelligence platform that has been market tested by the world’s leading brands.\u003c/p\u003e\n\u003cp\u003eNinthDecimal provides audience data, activation solutions, measurement, and insights across all media, empowering marketers to succeed in today’s omni-channel and data-driven world.\u003c/p\u003e\n\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eWe are looking for a Platform Engineer that will focus on enhancing a data driven business NinthDecimal. As a Platform Engineer, you should be a quick learner, enthusiastic about learning new technologies. You will implement technical solutions to empower internal/external customers and scale the existing platform. You will work closely with business owners to develop and define key business questions, then work with Data Scientist to build the data sets that answer those questions. You will work with huge data sets and build ETLs and analytic platform to bring datasets together to answer business questions, reporting and drive growth. This job is in our Chicago office.\u003c/p\u003e\n\u003cp\u003eThe responsibilities for this position include these activities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and implementation of the data driven initiatives at NinthDecimal such as Big Data analytics application development and architecture using Spark, Hadoop\u003c/li\u003e\n\u003cli\u003eUnderstanding business requirements and converting them to technical solutions. Create ETLs to take data from various upper stream locations and create a unified dimensional or star schema data model for analytics and reporting.\u003c/li\u003e\n\u003cli\u003eCollaborates with Data Scientist team to transform data and integrate algorithms and models into automated processes.\u003c/li\u003e\n\u003cli\u003eCollaborate with Devops and Operation team to setup highly distribute, large scale and high performance platform systems\u003c/li\u003e\n\u003cli\u003eCollaborate with other Backend engineers to formulate innovative solutions to experiment and implement advanced data algorithms\u003c/li\u003e\n\u003cli\u003eCommunicate complex concepts and the results of the analyses in a clear and effective manner to Product Owners\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications Required:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackground in SQL\u003c/li\u003e\n\u003cli\u003eStrong coding skills in Java, Python\u003c/li\u003e\n\u003cli\u003eExperiences in Scala strong plus\u003c/li\u003e\n\u003cli\u003eExperience with Big Data Technologies such as Hadoop, Spark, Hive.\u003c/li\u003e\n\u003cli\u003eExperience in dealing with hundreds of Tetabytes of data strong plus\u003c/li\u003e\n\u003cli\u003eExperience with building and optimizing large scale and high performance systems\u003c/li\u003e\n\u003cli\u003eKnowledge in Mesos, Yarn, Kubernetes, Docker, Airflow, Luigi\u003c/li\u003e\n\u003cli\u003eStrong collaboration and communication skills within and across teams.\u003c/li\u003e\n\u003cli\u003eB.S. or M.S. in Computer Science or a related field\u003c/li\u003e\n\u003cli\u003eFamiliarity with the digital media / advertising industry is a big plus\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jsco.re/2y3my\"\u003ehttps://jsco.re/2y3my\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"2987d5fb-01e5-4d77-ad5c-f51820f87b51","type":"Full Time","url":"https://jobs.github.com/positions/2987d5fb-01e5-4d77-ad5c-f51820f87b51","created_at":"Wed Jul 10 15:16:34 UTC 2019","company":"Avochato","company_url":"https://www.avochato.com","location":"San Francisco","title":"Full Stack Developer","description":"\u003ch1\u003eWho we are\u003c/h1\u003e\n\u003cp\u003eAvochato is an enterprise mobile messaging company based in San Francisco, California. Consumers prefer to communicate with messaging platforms, but businesses are built for email. Avochato upgrades enterprises to messaging. Join us in developing a product that users love.\u003c/p\u003e\n\u003ch1\u003eYour Role\u003c/h1\u003e\n\u003cp\u003eAs a Full Stack Developer you will collaborate closely with other members of the Product and Engineering teams to make new experiences come to life while addressing scalability and usability concerns on an iterative basis. On a given day at Avochato, you may:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop new and existing data models, as well as intuitive web interfaces to display and manipulate those models at scale\u003c/li\u003e\n\u003cli\u003eSubmit and review pull requests on a daily basis\u003c/li\u003e\n\u003cli\u003eResearch and integrate the Avochato Platform with external APIs based on business needs\u003c/li\u003e\n\u003cli\u003eDevelop and document public-facing RESTful APIs on behalf of Avochato customers\u003c/li\u003e\n\u003cli\u003eCollaborate with Customer Success and Product teams to solve complex business problems and debug new and existing regressions experienced by users\u003c/li\u003e\n\u003cli\u003eCollaborate with other engineers to pragmatically update and maintain the Avochato Messaging API, mobile apps, and web dashboard with zero downtime.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eRequirements:\u003c/h2\u003e\n\u003ch3\u003eSan Francisco / Bay Area on-site only. No remote options are available at this time.\u003c/h3\u003e\n\u003ch3\u003eBS/BA or higher preferred but not required.\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e5+ Years production experience developing dynamic web applications using CSS3 \u0026amp; HTML5 and an MVC framework\u003c/li\u003e\n\u003cli\u003e3+ Years production experience using Ruby on Rails\u003c/li\u003e\n\u003cli\u003e5+ Years production experience in collaboratively versioning and distributing code with Git\u003c/li\u003e\n\u003cli\u003e5+ Years using a SQL in production\u003c/li\u003e\n\u003cli\u003e3+ Years of cross-browser and mobile web experience including Chrome, Firefox, IE 8-11, Edge, Safari, Safari Mobile\u003c/li\u003e\n\u003cli\u003eStrong communication skills, autonomous but comfortable asking for help\u003c/li\u003e\n\u003cli\u003eThirst for knowledge\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eNice to have experience in any of the following:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003ePostGres\u003c/li\u003e\n\u003cli\u003eSASS\u003c/li\u003e\n\u003cli\u003eAWS (S3, Elastic Beanstalk, Cloudfront, Route53)\u003c/li\u003e\n\u003cli\u003eReact / React Native\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eWhat we're building\u003c/h1\u003e\n\u003cp\u003eAt Avochato, we believe customers are in the driver’s seat. Customers want the flexibility to communicate with businesses immediately and when they do, their experiences need to be personalized, instant, and always on. Facing increasing customer demands, sales, marketing, and customer support teams must rise to the occasion.\u003c/p\u003e\n\u003cp\u003eFortunately, Avochato makes it easy for all teams to connect with customers and deliver a seamless and efficient experience every step of the way from lead capture and nurturing to post-sale support. The result: you increase engagement with your customers to close more deals, faster than ever before.\u003c/p\u003e\n\u003cp\u003eSMS is the most immediate, attention-grabbing, and cost-effective communication channel there is. It boasts the highest read rate of any channel – over 90 percent of all texts are read within three minutes of delivery. It is not a surprise, then, to see that businesses around the world are increasingly adopting text messaging for their communications.\u003c/p\u003e\n\u003ch1\u003eWhy You’ll Love Avochato\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003eEveryone at Avochato is committed to making a positive impact above all else– as leaders we lead people to a better place, whether it’s a teammate, a customer, a customer’s customer, an investor, an advisor, a family member, or a friend-Avochato believes in personal growth, transparency, and a high degree of autonomy\u003c/li\u003e\n\u003cli\u003eCustomers (and employees) love our product. Check out our reviews on \u003ca href=\"https://www.g2crowd.com/products/avochato/reviews\"\u003eG2 Crowd\u003c/a\u003e, \u003ca href=\"https://www.capterra.com/p/161117/Avochato/\"\u003eCapterra\u003c/a\u003e and on \u003ca href=\"https://www.glassdoor.com/Overview/Working-at-Avochato-EI_IE2386240.11,19.htm\"\u003eGlassdoor\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003eSales cycles are fast at Avochato, and we celebrate every win on a daily basis across all teams\u003c/li\u003e\n\u003cli\u003eEmployee referral bonuses to encourage the addition of great people to the team\u003c/li\u003e\n\u003cli\u003eMedical, dental, and vision coverage for full-time employees, as well asa 401k plan\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eText AVO to +1 (415) 691-2455\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1ZyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--157979a0838aad75a333117ffd3bf4e6506d22f1/avochato-logo-vertical.png"},{"id":"cdaa783b-164a-4223-8497-cd6dd346055f","type":"Full Time","url":"https://jobs.github.com/positions/cdaa783b-164a-4223-8497-cd6dd346055f","created_at":"Tue Jul 09 17:14:40 UTC 2019","company":"SugarCRM","company_url":"http://www.sugarcrm.com","location":"Cupertino","title":"Senior Software Engineer (Platform)","description":"\u003cp\u003eWhere do you fit\u003c/p\u003e\n\u003cp\u003eThe SugarCRM platform team is responsible for creating robust, scalable, and highly performing technologies that drive our core CX (Customer Experience) offering.  You’ll be responsible for building new services and architectures while helping transform parts of our product lines into a robust and state of the art offering.  We are looking for exceptional engineers with a deep understanding of distributed systems, multi-language software development, and an understanding of what it takes to truly create an innovative platform that others can build on top of.\u003c/p\u003e\n\u003cp\u003eSo, if you are a motivated engineer looking to join a collaborative team, submit your application. You might be a perfect fit!\u003c/p\u003e\n\u003cp\u003eImpact you will make in the role\u003c/p\u003e\n\u003cp\u003eDevelopment of the core application platform and framework\nProduce high-quality, readable, scalable, secure software that performs well, and at lightning speed using test-driven development\nFurther develop, optimize, refactor and understand our software architecture\nPush the envelope of software design and architecture\nChallenge, mentor and learn from your peers\nDesign reviews and code reviews to keep the standards high\nContinually sharpen your own skills\u003c/p\u003e\n\u003cp\u003eExpertise you will bring in\u003c/p\u003e\n\u003cp\u003e5+ years in software development\nFamiliarity with microservices architectures, messaging, loosely coupled design, NoSQL / relational databases, Restful APIS and protobuf\nMust be able to adapt to a fast-paced collaborative environment\nStrong written and verbal communication abilities, flexibility, and commitment to meet deadlines are a must\nExperience developing CRM applications a plus\u003c/p\u003e\n\u003cp\u003eLocation: Cupertino, CA\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSugarCRM is not sponsoring immigration at this time. Relocation to the San Francisco Bay Area will be supported for the right candidate. *\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits and Perks:\u003c/p\u003e\n\u003cp\u003eBeyond a stellar work environment, friendly people, and inspiring work, we have some great benefits and perks:\u003c/p\u003e\n\u003cp\u003eCompetitive salaries\nExcellent medical, dental and vision coverage for you and your family, along with other benefit plans including 401(k) match\nUnlimited Paid Time Off\nWeekly catered lunch \u0026amp; learns, fully stocked kitchens, and nearby access to Cupertino’s newest restaurants and stores at Main Street Cupertino\nWellness Reimbursement Program\nOnsite Programs, depending on location, such as Dry Cleaning, Car Washes, Massage, Yoga, and more\nCareer \u0026amp; Personal Development Program – multi-platform\nNew Hire Onboarding for all new employees worldwide\nRegular social events\nOwnership is the greatest self-identity at SugarCRM - you are making an impact now\nWe are a merit-based company - many opportunities to learn, excel and grow your career\u003c/p\u003e\n\u003cp\u003eWe are an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://app.jobvite.com/j?cj=oX489fw2\u0026amp;s=Github_JobPost\"\u003ehttps://app.jobvite.com/j?cj=oX489fw2\u0026amp;s=Github_JobPost\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkpyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--687350130627c642cdcdb00ccd8de4e660750073/Full%20Color%20Logo_White%20Background_CMYK_Feb22_2016.png"},{"id":"d784fa22-d153-41d7-a081-ca38cd44ad95","type":"Full Time","url":"https://jobs.github.com/positions/d784fa22-d153-41d7-a081-ca38cd44ad95","created_at":"Mon Jul 01 21:28:06 UTC 2019","company":"Lawrence Berkeley National Laboratory","company_url":"http://www.lbl.gov","location":"Berkeley, Ca","title":"Usable Systems and Integrated Frameworks Engineer ","description":"\u003cp\u003eUsable Systems and Integrated Frameworks Engineer - 87495\nOrganization: JG-Joint Genome Institute\u003c/p\u003e\n\u003cp\u003eThe Biosciences Area within Berkeley Lab has an exciting career opportunity available for a software engineer to develop and deploy software solutions for a new framework for microbiome data science. The Department of Energy is funding a pilot program, the “National Microbiome Data Collaborative” (NMDC) which aims to address many of the pressing issues in microbiome research, including data integration, making data FAIR (findable, accessible, interoperable, and reusable) and establishing standardized workflows for data processing.\u003c/p\u003e\n\u003cp\u003eThe NMDC software engineer will collaborate with a diverse set of engineers, UI/UX experts, and scientists, to design and develop a modular infrastructure to enable the scientific community to manage and explore petabytes of microbiome data. This is a unique opportunity to shape a system that will advance the community’s ability to integrate and interrogate multi-omics data sets generated across the globe from diverse sources.\u003c/p\u003e\n\u003cp\u003eThis position reports to the Chief Informatics Officer at the DOE Joint Genome Institute in Berkeley, CA.\u003c/p\u003e\n\u003cp\u003eSoftware Engineer Level 2 will:\n• Deploy, install, configure, integrate, and test software solutions.\n• Collect, manipulate, and analyze data related to scientific computing systems.\n• Provide input to domain science and/or computer science research papers suitable for submission to peer-reviewed venues.\n• Present to audiences within and outside the lab.\u003c/p\u003e\n\u003cp\u003eIn addition to the above, Software Engineer Level 3 responsibilities include:\n• Coordinate and/or lead the development and science teams on requirements and features.\n• Coordinate and/or lead the software development process for the team.\u003c/p\u003e\n\u003cp\u003eSoftware Engineer Level 2 Required Qualifications:\n• Bachelor’s degree in a related field or equivalent experience.\n• At least five years of related experience\n• Proficiency programming in Python and at least one of: C/C++, Java, or JavaScript.\u003c/p\u003e\n\u003cp\u003ePreferred qualifications for the Software Engineer Level 2:\n• Master’s degree or equivalent work experience.\n• Demonstrated experience with the entire software development process, from requirements through design to implementation and deployment.\n• Experience with the design, development, and optimization web service infrastructure\n• Excellent English written and oral communication.\n• Strong interpersonal skills for working in a diverse team environment.\u003c/p\u003e\n\u003cp\u003eIn addition to the above, the Software Engineer Level 3 qualifications include:\n• Minimum of 8 years of related experience with a Bachelor’s degree; or 6 years and a Master’s degree; or equivalent experience.\n• Demonstrated ability to work independently and collaboratively and as a team member in a diverse team environment.\u003c/p\u003e\n\u003cp\u003ePreferred qualifications for the Software Engineer 3:\n• Experience applying modern software technologies for databases, RESTful services, computational workflows, data processing pipelines, and/or scientific reproducibility.\n• Experience as the lead of a development team.\n• Ability to conduct analysis and work independently.\u003c/p\u003e\n\u003cp\u003eThe posting shall remain open until the position is filled.\u003c/p\u003e\n\u003cp\u003eNotes:\n• This is a full time, 2-year term appointment with the possibility of extension or conversion to Career appointment based upon satisfactory job performance, continuing availability of funds and ongoing operational needs.\n• Classification will depend upon the applicant's level of skills, knowledge, and abilities. This position will be filled at the Software Developer Level 2 or Software Developer Level 3, dependent on experience.\n• Full-time, M-F, exempt (monthly paid) from overtime pay.\n• Salary is commensurate with experience.\n• This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.\n• Work will be primarily performed at DOE Joint Genome Institute (JGI) —  1 Cyclotron Road, Berkeley, CA.\u003c/p\u003e\n\u003cp\u003eHow To Apply\nApply directly online at \u003ca href=\"http://50.73.55.13/counter.php?id=164252\"\u003ehttp://50.73.55.13/counter.php?id=164252\u003c/a\u003e and follow the on-line instructions to complete the application process.\u003c/p\u003e\n\u003cp\u003eJGI \u0026amp; Berkeley Lab: A View to Fuel Innovative Science in the Public Interest\nThey say it’s all about location and Berkeley Lab has it all: a view above the San Francisco Bay, cool breezes, and world-class science within a diverse, respectful research ecosystem of 5,000 people. Nearly 90 years ago, Ernest Orlando Lawrence, the inventor of the cyclotron, brought physicists, biologists, engineers and mathematicians together in Berkeley above the University of California campus to tackle the most urgent scientific challenges. Today, after garnering 13 Nobel Prizes, Berkeley Lab has sustained and grown that tradition of open, interdisciplinary team science, exemplified by how the U.S. Department of Energy Joint Institute (JGI)  addresses the most pressing energy and environmental challenges. This summer, JGI takes up residence in the new, state-of-the-art Integrative Genomics Building (IGB) along with the U.S. Department of Energy Systems Biology Knowledgebase (KBase) to expand the frontiers of energy and environmental science in partnership with the worldwide community of researchers. Will you join us and be a critical part of the next ground-breaking discoveries in the public interest?\u003c/p\u003e\n\u003cp\u003eThe JGI is comprised of highly-skilled and diverse talent founded on a culture of scientific excellence, trust, curiosity, passion, and collaboration.\u003c/p\u003e\n\u003cp\u003eWorking at Berkeley Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding employee development opportunities. To view information about the many rewards that are offered at Berkeley Lab- Click Here (\u003ca href=\"https://commons.lbl.gov/display/hr/Benefits\"\u003ehttps://commons.lbl.gov/display/hr/Benefits\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eEqual Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the Pay Transparency Nondiscrimination Provision under 41 CFR 60-1.4 (\u003ca href=\"https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\"\u003ehttps://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\u003c/a\u003e). Click here (\u003ca href=\"http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\"\u003ehttp://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\u003c/a\u003e) to view the poster: \"Equal Employment Opportunity is the Law\".\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://50.73.55.13/counter.php?id=164252\"\u003ehttp://50.73.55.13/counter.php?id=164252\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXhxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7e897d007d5a1879f8bdeff1f547b6e53fcb9934/LawrenceBerkeleyLab.jpg"},{"id":"fd2b6740-22fb-4feb-8b48-ff1f4b21c442","type":"Full Time","url":"https://jobs.github.com/positions/fd2b6740-22fb-4feb-8b48-ff1f4b21c442","created_at":"Mon Jul 01 19:43:29 UTC 2019","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Siri - Data Engineer","description":"\u003cp\u003eJob Summary:\nPlay a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Build groundbreaking technology for large scale systems, spoken language, big data, and artificial intelligence. And work with the people who built the intelligent assistant that helps millions of people get things done â€” just by asking. Join the Siri Speech team at Apple. We are looking for exceptional data engineers passionate about customer experience, who love working with data for measuring and improving accuracy of ML models in products used by millions of customers all over the world.\u003c/p\u003e\n\u003cp\u003eKey Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in the development and maintenance of tools for analyzing and processing large amounts of data under Apache Hadoop and Spark\u003c/li\u003e\n\u003cli\u003eStrong programming skills in C/C++ and/or Java/Scala as well as scripting languages such as Python, Perl, and Bash\u003c/li\u003e\n\u003cli\u003ePrior experience working on ASR/MT training and test data sets in multiple languages is preferred\u003c/li\u003e\n\u003cli\u003eStrong analytical skills and a real passion for data and data quality Proficiency in visualizing data and statistics\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription:\nYou will be a part of a small, collaborative team of talented researchers and engineers responsible for data analysis, training and test data set creation, and related tools development. Your focus will be on providing the speech recognition and machine translation teams with the best training and test data sets. Directly contribute to the accuracy of Siri in all supported languages and devices. You should thrive in a dynamic environment with rapidly changing priorities, and collaborate well with other engineering teams at Apple.\u003c/p\u003e\n\u003cp\u003eEducation:\nB.S or M.S in Computer Science, or equivalent experience\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 200073619\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=89d931cbafc374d9a7f3fe1da667851b\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXRxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c492837a49537ef7f9a51fc130ada5d6a4c17eb8/Apple_300x300.jpeg"},{"id":"d94dd590-6471-4bf5-9221-1bf766a41210","type":"Full Time","url":"https://jobs.github.com/positions/d94dd590-6471-4bf5-9221-1bf766a41210","created_at":"Mon Jul 01 19:22:51 UTC 2019","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Software Engineer - Retail Store Apps \u0026 Infrastructure","description":"\u003cp\u003eJob Summary:\nImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\u003c/p\u003e\n\u003cp\u003eWe at the Retail store apps Cloud and Infrastructure engineering team strive to build and support tools and systems that enable our engineers to develop and publish software in a reliable and repeat-able way. We are looking for a passionate software engineer to join our team and help us build the next generation of tools that becomes the foundation of our cloud portfolio.\u003c/p\u003e\n\u003cp\u003eAre you a lifelong learner? Do you have a passion for building tools and automation? Come and join us in a fun-loving, highly motivated team and be a part of Apple’s WW retail journey.\u003c/p\u003e\n\u003cp\u003eKey Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA genuine passion for software engineering\u003c/li\u003e\n\u003cli\u003eHave in-depth knowledge in OO concepts, concurrent systems and deeper understanding of memory model in JVM languages.\u003c/li\u003e\n\u003cli\u003eShould be flexible about languages and platforms, but have production experience with JVM-based languages in Linux\u003c/li\u003e\n\u003cli\u003ePractical understanding of data structures, algorithms, and design patterns\u003c/li\u003e\n\u003cli\u003eExperience with developing web services based on REST standards\u003c/li\u003e\n\u003cli\u003eKnowledgeable on CI / CD tools like Jenkins / Travis CI/ Circle CI\u003c/li\u003e\n\u003cli\u003eHave experience on any one of build tools like Maven /Gradle /NPM /GoDep\u003c/li\u003e\n\u003cli\u003eWorking knowledge of Relational Data Store / NoSQL technologies is a plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDescription:\nAt Retail store apps team, we build and manage large scale web and iOS applications that are used by Apple retail store employees world wide. As we expand our presence from Apple Data center to other cloud providers, we are looking for a self driver and highly motivated software engineer to help us in this journey\u003c/p\u003e\n\u003cp\u003eShould have the ability to work in a fast-paced, high-demand environment\u003c/p\u003e\n\u003cp\u003eWhile you will write a fair amount of code, a lot of our work will also involve operationalizing and integrating systems to get continuous delivery pipeline kicking in.\u003c/p\u003e\n\u003cp\u003eWork closely with development and QE team to understand their needs and provide constant feedback to the partners\u003c/p\u003e\n\u003cp\u003eIdentify performance bottlenecks by working closely with development team and help in designing fault-tolerant and resilient applications\u003c/p\u003e\n\u003cp\u003eEducation:\nB.S or M.S in Computer science or related field.\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 200064794\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=d37e147165a30739be912cd3968dc788\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdU5xIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4fba586d9858a88eb3d2de1fca81931e829ab65f/Apple_300x300.jpeg"},{"id":"3ac5d3a2-cb99-4437-9cd3-dabc601afca5","type":"Full Time","url":"https://jobs.github.com/positions/3ac5d3a2-cb99-4437-9cd3-dabc601afca5","created_at":"Thu Jun 27 18:28:14 UTC 2019","company":"Lawrence Berkeley National Laboratory ","company_url":"https://www.lbl.gov/","location":"Berkeley, Ca","title":"Web Developer","description":"\u003cp\u003eWeb Developer -  87326\nOrganization:  ED-Energy Storage \u0026amp; Distributed Resources\u003c/p\u003e\n\u003cp\u003eBerkeley Lab’s Energy Storage \u0026amp; Distributed Resources Division (\u003ca href=\"https://esdr.lbl.gov/\"\u003ehttps://esdr.lbl.gov/\u003c/a\u003e) has an opening for a Web Developer. Be part of the revolution in scientific and technological breakthroughs brought on by advanced computing. The successful candidate will be part of a team that drives the Materials Project (MP, \u003ca href=\"https://www.materialsproject.org/\"\u003ehttps://www.materialsproject.org/\u003c/a\u003e) in new and exciting directions as the number and diversity of our simulations grow. The team is composed of both computer scientists and materials scientists, a team which will grow and evolve as our fast-paced project pushes new boundaries. For this position, we are specifically seeking web developers and designers who are versatile and passionate about both the frontend and backend, ready to tackle new problems as we continue to push technology and science forward.\u003c/p\u003e\n\u003cp\u003eThe Materials Project is a leader in the new wave of \"data-driven science\" that is already affecting how thousands of scientists, many of them world leaders in their fields, connect, explore, and interact with information and one another. We use millions of CPU-hours a year to compute the properties of advanced new materials,  and disseminate the information with web interfaces and APIs.\u003c/p\u003e\n\u003cp\u003eThis position will be hired at a level commensurate with the business needs; and skills, knowledge, and abilities of the successful candidate.\u003c/p\u003e\n\u003cp\u003eWhat You Will Do:\n• Iterate and improve upon the \u003ca href=\"http://www.materialsproject.org\"\u003ewww.materialsproject.org\u003c/a\u003e web site, adding advanced features for exploring, visualizing, and sharing materials data.\n• Enhance the visual layout of web pages, identify usability issues, and optimize the organization and flow of information.\n• Maintain our existing infrastructure based on Django and MongoDB, which also uses various additional technologies including jQuery, Highcharts, Plotly, Coffeescript, SQL, Vue.\n• Deploy the website using our Docker-based infrastructure and be responsible for website uptime.\n• Analyze website logs for user traffic and reporting purposes.\n• Design and implement new “apps” for new types of materials analyses, such as assessing battery properties or stability in water.\n• Develop and expand APIs for accessing data sets for data mining.\n• Expand the project to new territories, such as crowdsourced discovery of new materials and \"sandboxes\" for private exploration of interesting chemical compounds.\n• Interact with and collect feedback from the community of thousands of materials researchers using the site in order to drive improvements.\n• Participate in discussions with science teams in requirements gathering workshops and weekly meetings.\n• Embrace emerging standards while promoting best practices in order to push the limits of how the web can enable science.\n• Write reusable and extensible code.\n• Demonstrate good judgement and work well both independently and as part of a team.\n• Perform all aspects of planning, coding, testing, and development of web applications.\u003c/p\u003e\n\u003cp\u003eAdditional Responsibilities as needed:\n• User interface design principles\n• API Protocols including REST\n• Web service architectures such as monolithic, microservices, mesh, and serverless\n• Authentication protocols and standards such as OAuth, OpenID and CAS\n• NoSQL databases with MongoDB in particular\n• Containerized services deployments\n• High-level programming languages and object-oriented programming and design patterns\n• Unix environments\n• Python backend frameworks such as Django and Flask\n• Firewall configuration\n• Log analysis\u003c/p\u003e\n\u003cp\u003eWhat is Required:\n• Bachelor’s degrees and a minimum of 5 years of related experience; or 3 years and a Master’s degree; or equivalent work experience.\n• Experience writing HTML and CSS\n• Experience building web sites with modern frontend web frameworks such as React, Angular, or Vue (React preferred)\n• Experience coding collaboratively with Git\n• Experience writing web templates using Jinja2\n• Experience with mockup/wireframe/prototyping tools.\u003c/p\u003e\n\u003cp\u003eThe posting shall remain open until the position is filled, however for full consideration, please apply by close of business on July 10, 2019.\u003c/p\u003e\n\u003cp\u003eNotes:\n• This is a full time, 1-year term appointment with the possibility of extension or conversion to Career appointment based upon satisfactory job performance, continuing availability of funds and ongoing operational needs.\n• Classification will depend upon the applicant's level of skills, knowledge, and abilities.\n• Full-time, M-F, exempt (monthly paid) from overtime pay.\n• This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.\n• Work will be primarily performed at: Lawrence Berkeley National Lab, 1 Cyclotron Road, Berkeley, CA.\u003c/p\u003e\n\u003cp\u003eHow To Apply\nApply directly online at \u003ca href=\"http://50.73.55.13/counter.php?id=164006\"\u003ehttp://50.73.55.13/counter.php?id=164006\u003c/a\u003e and follow the on-line instructions to complete the application process.\u003c/p\u003e\n\u003cp\u003eBerkeley Lab (LBNL, \u003ca href=\"https://www.lbl.gov/\"\u003ehttps://www.lbl.gov/\u003c/a\u003e) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Berkeley Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Berkeley Lab for the U.S. Department of Energy’s Office of Science.\u003c/p\u003e\n\u003cp\u003eWorking at Berkeley Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding development opportunities.  To view information about the many rewards that are offered at Berkeley Lab- Click Here (\u003ca href=\"https://commons.lbl.gov/display/hr/Benefits\"\u003ehttps://commons.lbl.gov/display/hr/Benefits\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eEqual Employment Opportunity: Berkeley Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Berkeley Lab is in compliance with the Pay Transparency Nondiscrimination Provision (\u003ca href=\"https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\"\u003ehttps://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\u003c/a\u003e) under 41 CFR 60-1.4.  Click here (\u003ca href=\"https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\"\u003ehttps://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\u003c/a\u003e) to view the poster and supplement: \"Equal Employment Opportunity is the Law.\"\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply directly online at \u003ca href=\"http://50.73.55.13/counter.php?id=164006\"\u003ehttp://50.73.55.13/counter.php?id=164006\u003c/a\u003e and follow the on-line instructions to complete the application process.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVJxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--150cb87e4bd1bdd5631619596e035838cb7ccd4b/LawrenceBerkeleyLab.jpg"},{"id":"c5901f00-ec36-11e8-8d10-e7913612ce87","type":"Full Time","url":"https://jobs.github.com/positions/c5901f00-ec36-11e8-8d10-e7913612ce87","created_at":"Mon Nov 19 20:08:09 UTC 2018","company":"Prezi","company_url":"http://prezi.com","location":"San Francisco ","title":"Senior Full Stack Engineer ","description":"\u003cp\u003ePrezi strives to enable people to share ideas with each other, using our extraordinary product in a provenly more engaging and more effective way by helping millions of people build and deliver moving stories.\u003c/p\u003e\n\u003cp\u003eTo help our business stay on mission, we are looking for a senior full stack engineer to join us working on projects around the awareness, consideration and acquisition stages of the user journey.. Some examples are content discovery, content virality, end-to-end signup and payment experience, all SEO, email infrastructure, high traffic, top of the funnel part of the website etc. All of that with a laser focus on iterative increments of customer value.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eMake significant contributions to the business by working with a cross-functional team to provide expertise, ship high-quality work, and complex components.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork in an agile team and organization, continuously refine our own processes towards best team performance and most fun. Our Engineering Managers, Product Owners and Program Management Team are dedicated to supporting you with this.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork through a variety of technical challenges that will require creativity and close collaboration across internal functions (design, UX, sales, marketing, etc).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRelease early, release often, deploy to production from day one.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork with a toolchain across infrastructure, data, continuous integration, back end, front end and 3rd party integrations with new things to pick up on the way.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCoordinate and own development projects from beginning to end. Plan, implement with your fellow engineers, release, measure, repeat.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContribute to building our dev tools and architecture to enable us to more quickly ship new features into production at scale. Dev teams dedicate 20% of their time to this, while we also rely on our Infrastructure Team to help with major, company-wide tooling and infrastructure support.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eParticipate in hackathons and engineering days\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLearn from and share your knowledge with your team and colleagues on the go.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills and traits we are looking for:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA passion for delivering value to users\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExcellent communication skills, both verbal and written\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years experience in developing web applications in production (e.g. backend using Django, Rails, Node frontend using Backbone, React, Bootstrap)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA solid understanding of the full web technology stack (e.g. cloud infrastructure, HTTP, cookies, asset loading, caching, REST)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProficiency with servers, linux, cloud infrastructure, build systems, continuous integration\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA passion for clean, maintainable, well-tested code\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience working with applications at scale\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe ability to structure and build complex client side applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledge of test automation of backend and frontend applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExtensive knowledge of responsive design, web standards and modern browsers\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility and willingness to learn fast and pick up new things easily\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA work environment where people from all backgrounds can thrive and grow\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePeople who listen to your opinions and value them\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe opportunity to spend time working at our Budapest office\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe opportunity to go to tech conferences anywhere in the world\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFlexible working hours and untracked vacations\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eQuality meals, snacks, drinks every day\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA fun office with community activities, outings, presentations, office bar, happy hours, ping-pong/pool/foosball, a bar and sports leagues.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA centrally located office in downtown San Francisco\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e401k plan\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHealth, dental and vision insurance\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCommuter benefits\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/d5687acb1\"\u003ehttps://grnh.se/d5687acb1\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"fa45a40c-e77e-11e8-8888-30684bb94b56","type":"Full Time","url":"https://jobs.github.com/positions/fa45a40c-e77e-11e8-8888-30684bb94b56","created_at":"Tue Nov 13 20:06:53 UTC 2018","company":"Agilent","company_url":"http://Agilent","location":"Santa Clara, CA","title":"Senior Algorithm Software Developer ","description":"\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://recruiting.adp.com/srccar/public/RTI.home?c=2167807\u0026amp;d=External\u0026amp;r=5000354052006#/\"\u003ehttps://recruiting.adp.com/srccar/public/RTI.home?c=2167807\u0026amp;d=External\u0026amp;r=5000354052006#/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1a97a17a5a4f1abb222a19e01420242c1a567e84/746d1726-15c6-4046-961e-bfd02e4ed2a0"},{"id":"9999f1f0-e448-11e8-966e-602e38acf303","type":"Full Time","url":"https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303","created_at":"Fri Nov 09 21:36:14 UTC 2018","company":"BlueVine","company_url":"http://bluevine.com","location":"Redwood City, Ca","title":"Senior Python Developer","description":"\u003cp\u003eAt BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.\u003c/p\u003e\n\u003cp\u003eAs a \u003cstrong\u003eSenior Python Developer\u003c/strong\u003e at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS \u0026amp; PERKS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReceive over $1,000 annually for a wellness benefit of your choice\u003c/li\u003e\n\u003cli\u003eFree commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches\u003c/li\u003e\n\u003cli\u003eUnlimited snacks in fully stocked kitchens\u003c/li\u003e\n\u003cli\u003eGenerous PTO and holidays\u003c/li\u003e\n\u003cli\u003eExcellent health coverage and life insurance benefits\u003c/li\u003e\n\u003cli\u003eGenerous, paid parental leave which covers up to 15 weeks\u003c/li\u003e\n\u003cli\u003ePet-friendly offices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and build state-of-the-art web \u0026amp; mobile application using a variety of languages and tools\u003c/li\u003e\n\u003cli\u003eBuild distributed backend application in the cloud\u003c/li\u003e\n\u003cli\u003eUnderstand repeatable automated processes for building the application, test it, document it, and deploy it at scale\u003c/li\u003e\n\u003cli\u003eA desire to work as part of a growing, fast-paced, and highly-flexible team\u003c/li\u003e\n\u003cli\u003eWork closely with, and incorporate feedback from, product designers and other stakeholders in the company\u003c/li\u003e\n\u003cli\u003eBe able to develop a project through its entire lifecycle\u003c/li\u003e\n\u003cli\u003eHave strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines\u003c/li\u003e\n\u003cli\u003eProvide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE LOOK FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of Python (4+ years)\u003c/li\u003e\n\u003cli\u003eKnowledge of Django (2+ years)\u003c/li\u003e\n\u003cli\u003eExperience with Celery, RESTful APIs and server-side APIs integration\u003c/li\u003e\n\u003cli\u003eKnowledge of ORM, SQL and Data Modeling\u003c/li\u003e\n\u003cli\u003eExperience with TDD and ability to write quality unit tests\u003c/li\u003e\n\u003cli\u003eExperience with AWS, cloud deployments, devops and web security\u003c/li\u003e\n\u003cli\u003eKnowledge of JavaScript, HTML5, CSS3\u003c/li\u003e\n\u003cli\u003eAbility to quickly learn new technologies and adapt to a fast-paced development environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e[Senior Python Developer] (\u003ca href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e)\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"},{"id":"24c31152-e440-11e8-9240-8dede5d34cb0","type":"Full Time","url":"https://jobs.github.com/positions/24c31152-e440-11e8-9240-8dede5d34cb0","created_at":"Fri Nov 09 16:54:38 UTC 2018","company":"Apple Inc.","company_url":"http://www.apple.com","location":"Cupertino, CA","title":"Full Stack Engineer","description":"\u003cp\u003eDESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMarcom is Apple’s Global Marketing Communications group. We lead all of Apple’s advertising and marketing to ensure the flawless development and execution of world class communications.\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://apple.com\"\u003ehttp://apple.com\u003c/a\u003e is a critical part of Apple’s product marketing strategy and a showcase for internet standards and innovation. In the role of Full Stack Engineer, you build the development, testing and content integration pipeline for the platform. We expect you to grow developer productivity, enable continuous deployment, flawless content editing and minimize QA lifecycles.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Qualifications:\nStrong JavaScript/Node.js skills, with experience developing web applications and a real passion for learning more.\nYou have an understanding of npm, and experience with publishing modules\nExperience with web packaging tools like browserify, webpack and babel\nYou have capabilities in code quality linters like eslint and knowledge of JavaScript testing frameworks like Jasmine\nYou are proficient in web application security; incorporating security into the software development lifecycle\nYou're familiar with database architecture, scalability and performance and have experience of continuous integration and Jenkins\nYou have Broad UNIX knowledge and skills and are proficient working in bash\nYou have strong verbal and written interpersonal skills\nYou have experience with agile development processes and maintain a philosophy of writing performant, maintainable JavaScript\nYou dream of working in a creative and dynamic environment.\u003c/p\u003e\n\u003cp\u003eDescription:\nCollaborates with other technical teams on DevOps responsibilities for application deployment, performance, monitoring, reliability and scalability\u003c/p\u003e\n\u003cp\u003eManages expectations and provides ongoing status updates to team members.\u003c/p\u003e\n\u003cp\u003eResponsible for critical architectural planning, approaches to content management, integration and serving applications across the development pipeline.\u003c/p\u003e\n\u003cp\u003eUses virtual machines and containerization technologies such as Docker and leads development efforts on large-scale web-based projects,\u003c/p\u003e\n\u003cp\u003eEnsures robust and lasting solutions are selected and embraced.\u003c/p\u003e\n\u003cp\u003eWorks under tight deadlines and keeps producers updated on an ongoing basis.\u003c/p\u003e\n\u003cp\u003eDevelops positive multi-functional relationships and works well with all levels of management.\u003c/p\u003e\n\u003cp\u003eProvides solutions to complex problems in a concise and articulate way.\u003c/p\u003e\n\u003cp\u003eSeen as the 'go to\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 113025781\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=e0b804211ba9acb4bb3a3848d81de03a\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2771689af44c596d7935ae1de19a193ac678333/f470d99d-33e6-44f5-ac37-d1237f0a00d1"},{"id":"fa55ec4a-dd65-11e8-867f-7944d54de916","type":"Full Time","url":"https://jobs.github.com/positions/fa55ec4a-dd65-11e8-867f-7944d54de916","created_at":"Wed Oct 31 23:38:11 UTC 2018","company":"Bio-Rad Laboratories","company_url":"http://www.bio-rad.com","location":"Pleasanton, CA","title":"Backend Web Developer (Software Developer III Non-IT)","description":"\u003cp\u003eBackend Web Developer (Software Developer III Non-IT)\nBio-Rad Laboratories\u003c/p\u003e\n\u003cp\u003eOverview\nWho We Are and What We Do\u003c/p\u003e\n\u003cp\u003eBio-Rad is an established Fortune 1000 biotech company that creates products that help people live longer, healthier lives. Bio-Rad’s Digital Biology Group (DBG) in Pleasanton makes products (including data products) that are helping to eradicate cancer (among other things). We’ve worked hard at building a great culture here at the DBG that cultivates collaboration and innovation, and people are honestly really passionate about what they do here. Check Us Out\u003c/p\u003e\n\u003cp\u003eWhat We Are Looking For\u003c/p\u003e\n\u003cp\u003eA solid backend developer who will develop and own our cloud-based applications and platform for all our data products at the DBG. Are you passionate about delivering highly scalable and reusable code? Does driving and influencing cloud strategy at a Fortune 1000 company excite you?\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe one of the founding members of our new cloud data platform.\u003c/li\u003e\n\u003cli\u003eWork in a collaborative environment to apply well architected solutions within this space.\u003c/li\u003e\n\u003cli\u003eArchitect complex business logic and features to add to our web based applications from concept to implementation.\u003c/li\u003e\n\u003cli\u003eWork alongside Scientists, Marketing, and R\u0026amp;D Engineers through the Product Development life cycle and beyond.\u003c/li\u003e\n\u003cli\u003eDevelop / Improve the core infrastructure for high scalability.\u003c/li\u003e\n\u003cli\u003eWorking with an awesome group of humble, (super smart), hardworking team players that own their technical debt and slay it.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years’ experience as a Software Developer.\u003c/li\u003e\n\u003cli\u003eHands-on development experience with Python, Flask and Java in Linux environments.\u003c/li\u003e\n\u003cli\u003eHave successfully built scalable APIs according to best practices.\u003c/li\u003e\n\u003cli\u003eExperience with MySql, NoSQL databases, familiarity with Spark or Redshift Data warehousing.\u003c/li\u003e\n\u003cli\u003eExperience with Cloud Hosting (AWS preferred).\u003c/li\u003e\n\u003cli\u003eQuick learner with the ability to understand complex workflows and develop and validate innovative solutions to solve difficult problems.\u003c/li\u003e\n\u003cli\u003eExperienced with test automation: TDD, unit/integration/functional testing.\u003c/li\u003e\n\u003cli\u003eExperienced implementation efforts following an Agile software development lifecycle approach.\u003c/li\u003e\n\u003cli\u003eExcellent communication skills, both written and verbal.\u003c/li\u003e\n\u003cli\u003eA team-oriented contributor that aims to enhance the effectiveness of their colleagues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Bio-Rad:\u003c/p\u003e\n\u003cp\u003eBio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.\u003c/p\u003e\n\u003cp\u003eBio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.\u003c/p\u003e\n\u003cp\u003eEEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age\u003c/p\u003e\n\u003cp\u003eAgency Non-Solicitation:\u003c/p\u003e\n\u003cp\u003eBio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor full application instructions and position description, visit \u003ca href=\"http://apptrkr.com/1325674\"\u003ehttp://apptrkr.com/1325674\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--405fc0cd9aa563ecebeb8a7c041756da5d943aa1/9cdade0a-86e8-468a-855c-c5e820ec6520"},{"id":"48d5274e-dd45-11e8-8130-eacb3354d656","type":"Full Time","url":"https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656","created_at":"Wed Oct 31 19:45:06 UTC 2018","company":"Traction","company_url":"https://www.tractionco.com/","location":"Sunnyvale, CA ","title":"Lead Full Stack Developer","description":"\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"f3e305e6-dc66-11e8-8ec9-7dcb52a38c24","type":"Full Time","url":"https://jobs.github.com/positions/f3e305e6-dc66-11e8-8ec9-7dcb52a38c24","created_at":"Tue Oct 30 17:13:04 UTC 2018","company":"CommunityVenturePartners","company_url":"https://marinpost.org","location":"Mill Valley","title":"seeking webmaster assistance with frontend and backend.","description":"\u003cp\u003eThe Marin Post (\u003ca href=\"https://marinpost.org\"\u003ehttps://marinpost.org\u003c/a\u003e) seeking webmaster assistance, full-stack coder for frontend and backend coding.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork part time with flexible hours.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork remotely but MUST live in San Francisco Bay Area and be available for occasional face to face meetings in Southern Marin or North San Francisco (Please DO NOT APPLY if you do not live in SF Bay Area).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePay per experience level. Please provide an accurate resume of experience. Your prior employment will be verified.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eApplicant requirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003ePHP, Javascript, HTML, CSS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with Craft CMS and Twig or similar Content Management Systems but helpful to have experience with Craft CMS API (plugin) programming (\u003ca href=\"https://craftcms.com/\"\u003ehttps://craftcms.com/\u003c/a\u003e)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eVersed in Git / Github, able to create a pull request.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eemail resume to: \u003ca href=\"mailto:communityventurepartners@comcast.net\"\u003ecommunityventurepartners@comcast.net\u003c/a\u003e\u003c/p\u003e\n","company_logo":null}]